DROP TABLE IF EXISTS Лікує;
DROP TABLE IF EXISTS Наявні;
DROP TABLE IF EXISTS Співробітники;
DROP TABLE IF EXISTS Аптечна_установа;
DROP TABLE IF EXISTS Перелік_лікарств;
DROP TABLE IF EXISTS Посада;
DROP TABLE IF EXISTS Вулиця;
DROP TABLE IF EXISTS Зона_впливу;

CREATE TABLE Посада (
    Назва_посади VARCHAR(100) PRIMARY KEY
);

CREATE TABLE Вулиця (
    Назва_вулиці VARCHAR(100) PRIMARY KEY
);

CREATE TABLE Аптечна_установа (
	Назва_установи VARCHAR(100) PRIMARY KEY,
	Номер_будинку VARCHAR(10),
	Адреса_вебсторінки VARCHAR(255),

	Час_роботи VARCHAR(50),
	Чи_вихідний_у_суботу BIT,
	Чи_вихідний_у_неділю BIT,
	Назва_вулиці VARCHAR(100),

	FOREIGN KEY (Назва_вулиці) REFERENCES Вулиця(Назва_вулиці)

);


CREATE TABLE Співробітники (

	Прізвище VARCHAR(50),
	Ім_я  VARCHAR(50),
	По_батькові  VARCHAR(50),
	Ідентифікаційний_номер VARCHAR(10) UNIQUE,
	Серія_номер_паспорту VARCHAR(20),
	Трудовий_стаж INT,
	Дата_народження DATE,
	Назва_посади VARCHAR(100),
	Назва_установи VARCHAR(100),
	Код_співробітника AS (Прізвище + RIGHT(Ідентифікаційний_номер, 2)),

	
	PRIMARY KEY(Прізвище, Ім_я, По_батькові),
	CHECK (Ідентифікаційний_номер LIKE '[0-9][0-9][0-9][0-9][0-9][0-9][0-9][0-9][0-9][0-9]'),
	
	FOREIGN KEY (Назва_посади) REFERENCES Посада(Назва_посади),
	FOREIGN KEY (Назва_установи) REFERENCES Аптечна_установа (Назва_установи),
);


CREATE TABLE Перелік_лікарств (

	Назва_ліків VARCHAR(15) PRIMARY KEY,
	Код_міністерства VARCHAR(50) UNIQUE,
	Чи_потрібен_рецепт Bit,
	Чи_наркотичний_засіб Bit,
	Чи_психотропний_засіб Bit,

	 CHECK (
        SUBSTRING(Назва_ліків, 1, 1) = SUBSTRING(Код_міністерства, 1, 1)
    )

);


CREATE TABLE Зона_впливу (
	Назва_зони VARCHAR(100) PRIMARY KEY
);

--проміжні таблиці/зв'язки m:n

CREATE TABLE Наявні (

	Назва_установи VARCHAR(100),
	Назва_ліків VARCHAR(15),

	PRIMARY KEY (Назва_установи, Назва_ліків),

	FOREIGN KEY (Назва_установи) REFERENCES Аптечна_установа(Назва_установи),
    FOREIGN KEY (Назва_ліків) REFERENCES Перелік_лікарств(Назва_ліків)

);


CREATE TABLE Лікує (

	Назва_ліків VARCHAR(15),
	Назва_зони VARCHAR(100),

	PRIMARY KEY (Назва_ліків, Назва_зони),

	FOREIGN KEY (Назва_ліків) REFERENCES Перелік_лікарств(Назва_ліків),
    FOREIGN KEY (Назва_зони) REFERENCES Зона_впливу(Назва_зони)

);

--заповлення таблиць

INSERT INTO Посада (Назва_посади) VALUES ('Завідувач'), ('Провізор'), ('Фармацевт');
INSERT INTO Вулиця (Назва_вулиці) VALUES ('Городоцька'), ('Стрийська'), ('пр. Свободи');
INSERT INTO Зона_впливу (Назва_зони) VALUES ('Серцево-судинна'), ('Травлення'), ('Нервова система');

INSERT INTO Аптечна_установа (Назва_установи, Номер_будинку, Адреса_вебсторінки, Час_роботи, Чи_вихідний_у_суботу, Чи_вихідний_у_неділю, Назва_вулиці) 
VALUES ('Аптека №1', '10', 'apteka1.lviv.ua', '08:00-21:00', 0, 1, 'Городоцька');

INSERT INTO Перелік_лікарств (Назва_ліків, Код_міністерства, Чи_потрібен_рецепт, Чи_наркотичний_засіб, Чи_психотропний_засіб)
VALUES ('Анальгін', 'А-12345', 0, 0, 0), 
       ('Валеріана', 'В-98765', 0, 0, 0);


INSERT INTO Співробітники (Прізвище, Ім_я, По_батькові, Ідентифікаційний_номер, Серія_номер_паспорту, Трудовий_стаж, Дата_народження, Назва_посади, Назва_установи)
VALUES ('Шевченко', 'Андрій', 'Миколайович', '1234567890', 'КС 123456', 5, '1990-05-15', 'Провізор', 'Аптека №1');

INSERT INTO Наявні (Назва_установи, Назва_ліків) 
VALUES ('Аптека №1', 'Анальгін'), ('Аптека №1', 'Валеріана');

